absolutely, when I comment the code back again terraform shows me no changes:

```
➜  cn-env-default git:(infrastructure) ✗ terraform plan -target 'module.iam_user_user["marius.guscius"]' -target 'module.iam_user_user["neringa.vizbaraite"]'                   
Acquiring state lock. This may take a few moments...
module.iam_group_group["Developers"].aws_iam_group.group: Refreshing state... [id=TF-Developers]
module.iam_group_group["Administrators"].aws_iam_group.group: Refreshing state... [id=TF-Administrators]
module.iam_group_group["Tools"].aws_iam_group.group: Refreshing state... [id=TF-Tools]
module.iam_group_group["PO"].aws_iam_group.group: Refreshing state... [id=TF-PO]
module.iam_group_group["External"].aws_iam_group.group: Refreshing state... [id=TF-External]
module.iam_group_group["QA"].aws_iam_group.group: Refreshing state... [id=TF-QA]
module.iam_user_user["marius.guscius"].aws_iam_user.user: Refreshing state... [id=marius.guscius]
module.iam_user_user["marius.guscius"].module.generate_pgp_key[0].module.kms_key.aws_kms_key.key: Refreshing state... [id=6499d765-88da-449a-8cbb-41e8c733dc8e]
module.iam_user_user["marius.guscius"].aws_iam_user_policy_attachment.policy["arn:aws-cn:iam::aws:policy/IAMUserChangePassword"]: Refreshing state... [id=marius.guscius-20210201114159697000000003]
module.iam_user_user["marius.guscius"].aws_iam_user_group_membership.group: Refreshing state... [id=terraform-20210201113122294000000001]
module.iam_user_user["marius.guscius"].module.get_password[0].module.kms_key.aws_kms_key.key: Refreshing state... [id=1b178710-fc09-4f0c-ae60-04d6c2abac34]
module.iam_user_user["marius.guscius"].module.generate_pgp_key[0].module.kms_key.aws_kms_alias.key: Refreshing state... [id=alias/TF-Local-Script-Generate-PGP-Key-For-marius-guscius-User]
module.iam_user_user["marius.guscius"].module.generate_pgp_key[0].aws_secretsmanager_secret.script_output: Refreshing state... [id=arn:aws-cn:secretsmanager:cn-northwest-1:<hidden>:secret:TF-Generate-PGP-Key-For-marius-guscius-User-Script-Output-KSkziy]
module.iam_user_user["marius.guscius"].module.get_password[0].module.kms_key.aws_kms_alias.key: Refreshing state... [id=alias/TF-Local-Script-Decrypt-PGP-Password-For-marius-guscius-User]
module.iam_user_user["marius.guscius"].module.get_password[0].aws_secretsmanager_secret.script_output: Refreshing state... [id=arn:aws-cn:secretsmanager:cn-northwest-1:<hidden>:secret:TF-Decrypt-PGP-Password-For-marius-guscius-User-Script-Output-sHfg76]
module.iam_user_user["marius.guscius"].module.get_password[0].aws_secretsmanager_secret_version.default_script_output: Refreshing state... [id=arn:aws-cn:secretsmanager:cn-northwest-1:<hidden>:secret:TF-Decrypt-PGP-Password-For-marius-guscius-User-Script-Output-sHfg76|BEA6033E-3736-4198-ADF9-C18C5F7B4133]
module.iam_user_user["marius.guscius"].module.generate_pgp_key[0].aws_secretsmanager_secret_version.default_script_output: Refreshing state... [id=arn:aws-cn:secretsmanager:cn-northwest-1:<hidden>:secret:TF-Generate-PGP-Key-For-marius-guscius-User-Script-Output-KSkziy|E6E6BC7B-72C0-45C2-8758-EE9B87FD6ED4]
module.iam_user_user["marius.guscius"].module.generate_pgp_key[0].null_resource.script_create[0]: Refreshing state... [id=1920037031663918974]
module.iam_user_user["marius.guscius"].aws_iam_user_login_profile.user[0]: Refreshing state... [id=marius.guscius]
module.iam_user_user["marius.guscius"].module.get_password[0].null_resource.script_create[0]: Refreshing state... [id=6670113557000838495]

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

Warning: Resource targeting is in effect

You are creating a plan with the -target option, which means that the result
of this plan may not represent all of the changes requested by the current
configuration.

The -target option is not for routine use, and is provided only for
exceptional situations such as recovering from errors or mistakes, or when
Terraform specifically suggests to use it as part of an error message.

Releasing state lock. This may take a few moments...
```

Once I add another item to the map:
```
➜  cn-env-default git:(infrastructure) ✗ terraform plan -target 'module.iam_user_user["marius.guscius"]' -target 'module.iam_user_user["neringa.vizbaraite"]'
Acquiring state lock. This may take a few moments...
module.iam_group_group["QA"].aws_iam_group.group: Refreshing state... [id=TF-QA]
module.iam_group_group["Tools"].aws_iam_group.group: Refreshing state... [id=TF-Tools]
module.iam_group_group["PO"].aws_iam_group.group: Refreshing state... [id=TF-PO]
module.iam_group_group["Developers"].aws_iam_group.group: Refreshing state... [id=TF-Developers]
module.iam_group_group["External"].aws_iam_group.group: Refreshing state... [id=TF-External]
module.iam_group_group["Administrators"].aws_iam_group.group: Refreshing state... [id=TF-Administrators]
module.iam_user_user["marius.guscius"].aws_iam_user.user: Refreshing state... [id=marius.guscius]
module.iam_user_user["marius.guscius"].module.get_password[0].module.kms_key.aws_kms_key.key: Refreshing state... [id=1b178710-fc09-4f0c-ae60-04d6c2abac34]
module.iam_user_user["marius.guscius"].module.generate_pgp_key[0].module.kms_key.aws_kms_key.key: Refreshing state... [id=6499d765-88da-449a-8cbb-41e8c733dc8e]
module.iam_user_user["marius.guscius"].aws_iam_user_group_membership.group: Refreshing state... [id=terraform-20210201113122294000000001]
module.iam_user_user["marius.guscius"].aws_iam_user_policy_attachment.policy["arn:aws-cn:iam::aws:policy/IAMUserChangePassword"]: Refreshing state... [id=marius.guscius-20210201114159697000000003]
module.iam_user_user["marius.guscius"].module.generate_pgp_key[0].module.kms_key.aws_kms_alias.key: Refreshing state... [id=alias/TF-Local-Script-Generate-PGP-Key-For-marius-guscius-User]
module.iam_user_user["marius.guscius"].module.generate_pgp_key[0].aws_secretsmanager_secret.script_output: Refreshing state... [id=arn:aws-cn:secretsmanager:cn-northwest-1:<hidden>:secret:TF-Generate-PGP-Key-For-marius-guscius-User-Script-Output-KSkziy]
module.iam_user_user["marius.guscius"].module.get_password[0].module.kms_key.aws_kms_alias.key: Refreshing state... [id=alias/TF-Local-Script-Decrypt-PGP-Password-For-marius-guscius-User]
module.iam_user_user["marius.guscius"].module.get_password[0].aws_secretsmanager_secret.script_output: Refreshing state... [id=arn:aws-cn:secretsmanager:cn-northwest-1:<hidden>:secret:TF-Decrypt-PGP-Password-For-marius-guscius-User-Script-Output-sHfg76]
module.iam_user_user["marius.guscius"].module.generate_pgp_key[0].aws_secretsmanager_secret_version.default_script_output: Refreshing state... [id=arn:aws-cn:secretsmanager:cn-northwest-1:<hidden>:secret:TF-Generate-PGP-Key-For-marius-guscius-User-Script-Output-KSkziy|E6E6BC7B-72C0-45C2-8758-EE9B87FD6ED4]
module.iam_user_user["marius.guscius"].module.get_password[0].aws_secretsmanager_secret_version.default_script_output: Refreshing state... [id=arn:aws-cn:secretsmanager:cn-northwest-1:<hidden>:secret:TF-Decrypt-PGP-Password-For-marius-guscius-User-Script-Output-sHfg76|BEA6033E-3736-4198-ADF9-C18C5F7B4133]
module.iam_user_user["marius.guscius"].module.generate_pgp_key[0].null_resource.script_create[0]: Refreshing state... [id=1920037031663918974]
module.iam_user_user["marius.guscius"].aws_iam_user_login_profile.user[0]: Refreshing state... [id=marius.guscius]
module.iam_user_user["marius.guscius"].module.get_password[0].null_resource.script_create[0]: Refreshing state... [id=6670113557000838495]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.iam_user_user["marius.guscius"].aws_iam_user_login_profile.user[0] must be replaced
-/+ resource "aws_iam_user_login_profile" "user" {
      ~ encrypted_password      = "<hidden>" -> (known after apply)
      ~ id                      = "marius.guscius" -> (known after apply)
      ~ key_fingerprint         = "<hidden>" -> (known after apply)
      ~ pgp_key                 = "<hidden>" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.iam_user_user["neringa.vizbaraite"].aws_iam_user.user will be created
  + resource "aws_iam_user" "user" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "neringa.vizbaraite"
      + path          = "/"
      + tags          = {
          + "IsOwnedBy"   = "Terraform"
          + "IsProtected" = "1"
          + "Name"        = "neringa.vizbaraite"
        }
      + unique_id     = (known after apply)
    }

  # module.iam_user_user["neringa.vizbaraite"].aws_iam_user_group_membership.group will be created
  + resource "aws_iam_user_group_membership" "group" {
      + groups = [
          + "TF-QA",
        ]
      + id     = (known after apply)
      + user   = "neringa.vizbaraite"
    }

  # module.iam_user_user["neringa.vizbaraite"].aws_iam_user_login_profile.user[0] will be created
  + resource "aws_iam_user_login_profile" "user" {
      + encrypted_password      = (known after apply)
      + id                      = (known after apply)
      + key_fingerprint         = (known after apply)
      + password_length         = 20
      + password_reset_required = true
      + pgp_key                 = (known after apply)
      + user                    = "neringa.vizbaraite"
    }

  # module.iam_user_user["neringa.vizbaraite"].aws_iam_user_policy_attachment.policy["arn:aws-cn:iam::aws:policy/IAMUserChangePassword"] will be created
  + resource "aws_iam_user_policy_attachment" "policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws-cn:iam::aws:policy/IAMUserChangePassword"
      + user       = "neringa.vizbaraite"
    }

  # module.iam_user_user["marius.guscius"].module.generate_pgp_key[0].data.external.get_output will be read during apply
  # (config refers to values not yet known)
 <= data "external" "get_output"  {
      ~ id          = "-" -> (known after apply)
      ~ result      = {
          - "output" = jsonencode(
                {
                  - name         = "marius.guscius"
                  - private      = <<-EOT
                        -----BEGIN PGP PRIVATE KEY BLOCK-----
                        <hidden>
                        -----END PGP PRIVATE KEY BLOCK-----
                    EOT
                  - public       = <<-EOT
                        -----BEGIN PGP PUBLIC KEY BLOCK-----
                        <hidden>
                        -----END PGP PUBLIC KEY BLOCK-----
                    EOT
                  - public_bytes = "<hidden>"
                }
            )
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.iam_user_user["marius.guscius"].module.get_password[0].data.external.get_output will be read during apply
  # (config refers to values not yet known)
 <= data "external" "get_output"  {
      ~ id          = "-" -> (known after apply)
      ~ query       = {
          ~ "aws_region"        = "cn-northwest-1" -> (known after apply)
          ~ "credentials_file"  = "../../../../cn-env-default/credentials.sec" -> (known after apply)
          ~ "output_secret_arn" = "arn:aws-cn:secretsmanager:cn-northwest-1:<hidden>:secret:TF-Decrypt-PGP-Password-For-marius-guscius-User-Script-Output-sHfg76" -> (known after apply)
        }
      ~ result      = {
          - "output" = jsonencode(
                {
                  - password = "nZC0)45{0Z*mpSB8J[E0"
                }
            )
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.iam_user_user["marius.guscius"].module.get_password[0].null_resource.script_create[0] must be replaced
-/+ resource "null_resource" "script_create" {
      ~ id       = "6670113557000838495" -> (known after apply)
      ~ triggers = {
          - "aws_region"              = "cn-northwest-1"
          - "create_files_hash"       = "621b9b06a0d0d50b475d447e93e36546"
          - "create_script_settings"  = "<hidden>"
          - "credentials_file"        = "../../../../cn-env-default/credentials.sec"
          - "init_create_script_hash" = "93ccdbcee9686a491f5c53875933f97b"
          - "interpreter"             = "./"
          - "output_secret_arn"       = "arn:aws-cn:secretsmanager:cn-northwest-1:<hidden>:secret:TF-Decrypt-PGP-Password-For-marius-guscius-User-Script-Output-sHfg76"
          - "working_dir"             = "../modules/utils/local_script/script"
        } -> (known after apply) # forces replacement
    }

  # module.iam_user_user["neringa.vizbaraite"].module.generate_pgp_key[0].data.external.get_output will be read during apply
  # (config refers to values not yet known)
 <= data "external" "get_output"  {
      + id          = (known after apply)
      + program     = [
          + "python3",
          + "get_output.py",
        ]
      + query       = {
          + "aws_region"        = (known after apply)
          + "credentials_file"  = (known after apply)
          + "output_secret_arn" = (known after apply)
        }
      + result      = (known after apply)
      + working_dir = "../modules/utils/local_script/script"
    }

  # module.iam_user_user["neringa.vizbaraite"].module.generate_pgp_key[0].aws_secretsmanager_secret.script_output will be created
  + resource "aws_secretsmanager_secret" "script_output" {
      + arn                     = (known after apply)
      + description             = "TF ::: Generate PGP Key For neringa.vizbaraite User ::: Script Output"
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = "TF-Generate-PGP-Key-For-neringa-vizbaraite-User-Script-Output"
      + name_prefix             = (known after apply)
      + policy                  = (known after apply)
      + recovery_window_in_days = 0
      + rotation_enabled        = (known after apply)
      + rotation_lambda_arn     = (known after apply)
      + tags                    = {
          + "IsInternal"  = "1"
          + "IsOwnedBy"   = "Terraform"
          + "IsProtected" = "1"
          + "Name"        = "Generate PGP Key For neringa.vizbaraite User"
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.iam_user_user["neringa.vizbaraite"].module.generate_pgp_key[0].aws_secretsmanager_secret_version.default_script_output will be created
  + resource "aws_secretsmanager_secret_version" "default_script_output" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.iam_user_user["neringa.vizbaraite"].module.generate_pgp_key[0].null_resource.script_create[0] will be created
  + resource "null_resource" "script_create" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.iam_user_user["neringa.vizbaraite"].module.get_password[0].data.external.get_output will be read during apply
  # (config refers to values not yet known)
 <= data "external" "get_output"  {
      + id          = (known after apply)
      + program     = [
          + "python3",
          + "get_output.py",
        ]
      + query       = {
          + "aws_region"        = (known after apply)
          + "credentials_file"  = (known after apply)
          + "output_secret_arn" = (known after apply)
        }
      + result      = (known after apply)
      + working_dir = "../modules/utils/local_script/script"
    }

  # module.iam_user_user["neringa.vizbaraite"].module.get_password[0].aws_secretsmanager_secret.script_output will be created
  + resource "aws_secretsmanager_secret" "script_output" {
      + arn                     = (known after apply)
      + description             = "TF ::: Decrypt PGP Password For neringa.vizbaraite User ::: Script Output"
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = "TF-Decrypt-PGP-Password-For-neringa-vizbaraite-User-Script-Output"
      + name_prefix             = (known after apply)
      + policy                  = (known after apply)
      + recovery_window_in_days = 0
      + rotation_enabled        = (known after apply)
      + rotation_lambda_arn     = (known after apply)
      + tags                    = {
          + "IsInternal"  = "1"
          + "IsOwnedBy"   = "Terraform"
          + "IsProtected" = "1"
          + "Name"        = "Decrypt PGP Password For neringa.vizbaraite User"
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.iam_user_user["neringa.vizbaraite"].module.get_password[0].aws_secretsmanager_secret_version.default_script_output will be created
  + resource "aws_secretsmanager_secret_version" "default_script_output" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.iam_user_user["neringa.vizbaraite"].module.get_password[0].null_resource.script_create[0] will be created
  + resource "null_resource" "script_create" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.iam_user_user["neringa.vizbaraite"].module.generate_pgp_key[0].module.kms_key.aws_kms_alias.key will be created
  + resource "aws_kms_alias" "key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/TF-Local-Script-Generate-PGP-Key-For-neringa-vizbaraite-User"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.iam_user_user["neringa.vizbaraite"].module.generate_pgp_key[0].module.kms_key.aws_kms_key.key will be created
  + resource "aws_kms_key" "key" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days  = 7
      + description              = "TF ::: Local Script ::: Generate PGP Key For neringa.vizbaraite User"
      + enable_key_rotation      = false
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws-cn:iam::<hidden>:root"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "sns.amazonaws.com",
                              + "s3.amazonaws.com",
                              + "events.amazonaws.com",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey",
                          + "kms:Decrypt",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + kms:CallerAccount = [
                                  + "<hidden>",
                                ]
                              + kms:ViaService    = [
                                  + "s3.cn-northwest-1.amazonaws.com",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                     = {
          + "IsOwnedBy"   = "Terraform"
          + "IsProtected" = "1"
          + "Name"        = "Generate PGP Key For neringa.vizbaraite User"
          + "Recipient"   = "Local Script"
        }
    }

  # module.iam_user_user["neringa.vizbaraite"].module.get_password[0].module.kms_key.aws_kms_alias.key will be created
  + resource "aws_kms_alias" "key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/TF-Local-Script-Decrypt-PGP-Password-For-neringa-vizbaraite-User"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.iam_user_user["neringa.vizbaraite"].module.get_password[0].module.kms_key.aws_kms_key.key will be created
  + resource "aws_kms_key" "key" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days  = 7
      + description              = "TF ::: Local Script ::: Decrypt PGP Password For neringa.vizbaraite User"
      + enable_key_rotation      = false
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws-cn:iam::<hidden>:root"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "sns.amazonaws.com",
                              + "s3.amazonaws.com",
                              + "events.amazonaws.com",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey",
                          + "kms:Decrypt",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + kms:CallerAccount = [
                                  + "<hidden>",
                                ]
                              + kms:ViaService    = [
                                  + "s3.cn-northwest-1.amazonaws.com",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                     = {
          + "IsOwnedBy"   = "Terraform"
          + "IsProtected" = "1"
          + "Name"        = "Decrypt PGP Password For neringa.vizbaraite User"
          + "Recipient"   = "Local Script"
        }
    }

Plan: 16 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ users = {
      ~ marius.guscius     = {
          ~ password        = "<hidden>" -> (known after apply)
            # (3 unchanged elements hidden)
        }
      + neringa.vizbaraite = {
          + api_credentials = {
              + access_key        = ""
              + secret_access_key = ""
            }
          + arn             = (known after apply)
          + name            = "neringa.vizbaraite"
          + password        = (known after apply)
        }
        # (4 unchanged elements hidden)
    }

Warning: Resource targeting is in effect

You are creating a plan with the -target option, which means that the result
of this plan may not represent all of the changes requested by the current
configuration.

The -target option is not for routine use, and is provided only for
exceptional situations such as recovering from errors or mistakes, or when
Terraform specifically suggests to use it as part of an error message.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```